In [3]:
pip install pandas numpy

Requirement already satisfied: pandas in c:\users\uzarn\anaconda\lib\site-packages (2.2.2)
Requirement already satisfied: numpy in c:\users\uzarn\anaconda\lib\site-packages (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\uzarn\anaconda\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\uzarn\anaconda\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\uzarn\anaconda\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\uzarn\anaconda\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

df1 = pd.read_csv("tourism_dataset.csv")
df2 = pd.read_csv("travel_cost.csv")

In [5]:
print("[Tourism Columns]")
print(df1.columns)
print("------------------------------------------------------------------------------------------------------------------------------------")
print("[Travel Cost Columns]")
print(df2.columns)

[Tourism Columns]
Index(['Location', 'Country', 'Category', 'Visitors', 'Rating', 'Revenue',
       'Accommodation_Available'],
      dtype='object')
------------------------------------------------------------------------------------------------------------------------------------
[Travel Cost Columns]
Index(['Trip ID', 'Destination', 'Start date', 'End date', 'Duration (days)',
       'Traveler name', 'Traveler age', 'Traveler gender',
       'Traveler nationality', 'Accommodation type', 'Accommodation cost',
       'Transportation type', 'Transportation cost'],
      dtype='object')

In [6]:
print("[Tourism Dataset Head]")
print(df1.head)
print("------------------------------------------------------------------------------------------------------------------------------------")
print("[Travel Cost Dataset Head]")
print(df2.head)

[Tourism Dataset Head]
<bound method NDFrame.head of         Location Country    Category  Visitors  Rating    Revenue  \
0     kuBZRkVsAR   India      Nature    948853    1.32   84388.38
1     aHKUXhjzTo     USA  Historical    813627    2.01  802625.60
2     dlrdYtJFTA  Brazil      Nature    508673    1.42  338777.11
3     DxmlzdGkHK  Brazil  Historical    623329    1.09  295183.60
4     WJCCQlepnz  France    Cultural    124867    1.43  547893.24
...          ...     ...         ...       ...     ...        ...
5984  xAzwnVKAqz     USA       Urban    828137    1.97  132848.78
5985  IfKotyaJFC  France      Nature    276317    3.53  325183.96
5986  bPyubCWGgA   Egypt       Beach    809198    3.37  927336.50
5987  kkWIucpBnu   Egypt    Cultural    808303    2.52  115791.43
5988  gHXUrdticm  France    Cultural     40939    4.65  957026.85

     Accommodation_Available
0                        Yes
1                         No
2                        Yes
3                        Yes
4                         No
...                      ...
5984                      No
5985                     Yes
5986                      No
5987                     Yes
5988                     Yes

[5989 rows x 7 columns]>
------------------------------------------------------------------------------------------------------------------------------------
[Travel Cost Dataset Head]
<bound method NDFrame.head of      Trip ID             Destination Start date   End date  Duration (days)  \
0          1              London, UK   5/1/2023   5/8/2023              7.0
1          2        Phuket, Thailand  6/15/2023  6/20/2023              5.0
2          3         Bali, Indonesia   7/1/2023   7/8/2023              7.0
3          4           New York, USA  8/15/2023  8/29/2023             14.0
4          5            Tokyo, Japan  9/10/2023  9/17/2023              7.0
..       ...                     ...        ...        ...              ...
134      135  Rio de Janeiro, Brazil   8/1/2023  8/10/2023              9.0
135      136       Vancouver, Canada  8/15/2023  8/21/2023              6.0
136      137       Bangkok, Thailand   9/1/2023   9/8/2023              7.0
137      138        Barcelona, Spain  9/15/2023  9/22/2023              7.0
138      139   Auckland, New Zealand  10/1/2023  10/8/2023              7.0

       Traveler name  Traveler age Traveler gender Traveler nationality  \
0         John Smith          35.0            Male             American
1           Jane Doe          28.0          Female             Canadian
2          David Lee          45.0            Male               Korean
3      Sarah Johnson          29.0          Female              British
4         Kim Nguyen          26.0          Female           Vietnamese
..               ...           ...             ...                  ...
134       Jose Perez          37.0            Male            Brazilian
135      Emma Wilson          29.0          Female             Canadian
136        Ryan Chen          34.0            Male              Chinese
137  Sofia Rodriguez          25.0          Female              Spanish
138    William Brown          39.0            Male        New Zealander

    Accommodation type Accommodation cost Transportation type  \
0                Hotel               1200              Flight
1               Resort                800              Flight
2                Villa               1000              Flight
3                Hotel               2000              Flight
4               Airbnb                700               Train
..                 ...                ...                 ...
134             Hostel               2500                 Car
135              Hotel               5000            Airplane
136             Hostel               2000               Train
137             Airbnb               6000            Airplane
138              Hotel               7000               Train

    Transportation cost
0                   600
1                   500
2                   700
3                  1000
4                   200
..                  ...
134                2000
135                3000
136                1000
137                2500
138                2500

[139 rows x 13 columns]>

In [7]:
null_rows = df2[df2["Destination"].isna()]
print(null_rows)

     Trip ID Destination Start date End date  Duration (days) Traveler name  \
71        72         NaN        NaN      NaN              NaN           NaN
127      128         NaN        NaN      NaN              NaN           NaN

     Traveler age Traveler gender Traveler nationality Accommodation type  \
71            NaN             NaN                  NaN                NaN
127           NaN             NaN                  NaN                NaN

    Accommodation cost Transportation type Transportation cost
71                 NaN                 NaN                 NaN
127                NaN                 NaN                 NaN

In [8]:
df2 = df2.dropna()

null_rows = df2[df2["Destination"].isna()]
if null_rows.empty:
    print("No null values remaining.")
else:
    print(null_rows)

No null values remaining.

In [9]:
print(df2["Destination"])

0                  London, UK
1            Phuket, Thailand
2             Bali, Indonesia
3               New York, USA
4                Tokyo, Japan
                ...
134    Rio de Janeiro, Brazil
135         Vancouver, Canada
136         Bangkok, Thailand
137          Barcelona, Spain
138     Auckland, New Zealand
Name: Destination, Length: 136, dtype: object

In [10]:
df2["country"] = df2["Destination"].apply(
    lambda x: str(x).split(",")[-1].strip() if isinstance(x, str) and "," in x else str(x).strip()
)

In [11]:
print(df2["country"])

0               UK
1         Thailand
2        Indonesia
3              USA
4            Japan
          ...
134         Brazil
135         Canada
136       Thailand
137          Spain
138    New Zealand
Name: country, Length: 136, dtype: object

Now that we have made the destinations more uniform, we can look at the accomodation and travel prices from travel_cost.csv.

We know that the travel_cost dataset has two separate columns listing the different costs associated with different accommodation and transportation types. For the purpose of this assignment, we can just use generalized dummy data, so we will just be combining these columns to create an 'Estimated Costs' column.

In [13]:
print(df2["Accommodation cost"])

0      1200
1       800
2      1000
3      2000
4       700
       ...
134    2500
135    5000
136    2000
137    6000
138    7000
Name: Accommodation cost, Length: 136, dtype: object

In [14]:
print(df2["Transportation cost"])

0       600
1       500
2       700
3      1000
4       200
       ...
134    2000
135    3000
136    1000
137    2500
138    2500
Name: Transportation cost, Length: 136, dtype: object

At first glance it may seem like these are all uniform values and we're all set to start working with the data...

In [16]:
print(df2["Accommodation cost"][17])
print(df2["Transportation cost"][75])

$1,500
700 USD

But digging deeper into the data, you can see some of the values are listed with a "$" or followed by " USD" to specify American Dollars, as well as comma separated costs. Let's strip these to simplify the columns.

In [18]:
df2['Accommodation cost'] = df2['Accommodation cost'].replace({r'\$': '', ' USD': '', ',': ''}, regex=True).astype(float)
df2['Transportation cost'] = df2['Transportation cost'].replace({r'\$': '', ' USD': '', ',': ''}, regex=True).astype(float)

In [19]:
print(df2["Accommodation cost"][17])
print(df2["Transportation cost"][75])

1500.0
700.0

Now our accommodation and transportation costs are uniform, we can create our estimated cost column

In [21]:
df2["Estimated cost"] = df2["Accommodation cost"] + df2["Transportation cost"]

print(df2[["Accommodation cost", "Transportation cost", "Estimated cost"]])

     Accommodation cost  Transportation cost  Estimated cost
0                1200.0                600.0          1800.0
1                 800.0                500.0          1300.0
2                1000.0                700.0          1700.0
3                2000.0               1000.0          3000.0
4                 700.0                200.0           900.0
..                  ...                  ...             ...
134              2500.0               2000.0          4500.0
135              5000.0               3000.0          8000.0
136              2000.0               1000.0          3000.0
137              6000.0               2500.0          8500.0
138              7000.0               2500.0          9500.0

[136 rows x 3 columns]

Now we can merge the estimated costs to the original dataset based on country. Let's first create out function to associate the random costs with country.

In [134]:
import random

country_costs = df2.groupby("Destination")["Estimated cost"].apply(list).to_dict()

def get_random_cost(country):
    if country in country_costs:
        base_cost = random.choice(country_costs[country])
    else:
        # avg overall cost for all trips
        base_cost = sum([sum(vals) for vals in country_costs.values()]) / len(country_costs)
    variance = random.uniform(-0.15, 0.15)
    varied_cost = base_cost * (1 + variance)
    return round(varied_cost / 50) * 50

Next, let's add an "Estimated cost" column and apply this to our tourism dataset.

In [137]:
df1["Estimated cost"] = df1["Country"].apply(get_random_cost)

print(df1[["Country", "Estimated cost"]])

     Country  Estimated cost
0      India            5000
1        USA            4400
2     Brazil             250
3     Brazil             200
4     France             800
...      ...             ...
5984     USA            4500
5985  France            1000
5986   Egypt             850
5987   Egypt             750
5988  France            1000

[5989 rows x 2 columns]

In [33]:
print(df1["Country"].value_counts())

Country
Egypt        912
India        896
France       857
USA          848
Brazil       840
Australia    830
China        806
Name: count, dtype: int64

In [88]:
df1[df1["Country"] == "USA"]["Estimated cost"].value_counts()

Estimated cost
1750    105
1450    103
1400    103
1500     96
1550     86
1650     83
1700     83
1600     81
1350     75
1800     33
Name: count, dtype: int64

Next, let's add a randomly generated mode of travel and start/end date for each trip:

In [125]:
import datetime
import time

# randomized mode of travel
# is there a better way to instantiate a column based on a condition in pandas?
df1["mode_of_travel"] = df1.apply(lambda _: random.choice(["land", "air"]), axis=1)

# randomized date past May 2025
# fixed trip duration of seven days

# Using code for generating a random date from https://stackoverflow.com/questions/553303/how-to-generate-a-random-date-between-two-other-dates
def random_date(start, end, time_format, prop):
    stime = time.mktime(time.strptime(start, time_format))
    etime = time.mktime(time.strptime(end, time_format))

    ptime = stime + prop * (etime - stime)

    return time.strftime(time_format, time.localtime(ptime))

df1["start_date"] = df1.apply(lambda _: random_date("5-1-25", "5-1-26", '%m-%d-%y', random.random()), axis=1)

# References: https://stackoverflow.com/questions/2803852/python-date-string-to-date-object
# https://docs.python.org/3/library/time.html
df1["end_date"] = df1["start_date"].apply(lambda start: (datetime.datetime.strptime(start, '%m-%d-%y') + datetime.timedelta(days=7)).strftime('%m-%d-%y'))

df1[["mode_of_travel", "start_date", "end_date"]]

     mode_of_travel start_date  end_date
0               air   07-24-25  07-31-25
1              land   10-29-25  11-05-25
2              land   01-07-26  01-14-26
3               air   08-16-25  08-23-25
4              land   06-20-25  06-27-25
...             ...        ...       ...
5984           land   09-01-25  09-08-25
5985           land   12-19-25  12-26-25
5986            air   09-06-25  09-13-25
5987           land   08-18-25  08-25-25
5988            air   01-24-26  01-31-26

[5989 rows x 3 columns]

In [127]:
df1

,Location,Country,Category,Visitors,Rating,Revenue,Accommodation_Available,Estimated cost,mode_of_travel,start_date,end_date
0,kuBZRkVsAR,India,Nature,948853,1.32,84388.38,Yes,1350,air,07-24-25,07-31-25
1,aHKUXhjzTo,USA,Historical,813627,2.01,802625.60,No,1450,land,10-29-25,11-05-25
2,dlrdYtJFTA,Brazil,Nature,508673,1.42,338777.11,Yes,200,land,01-07-26,01-14-26
3,DxmlzdGkHK,Brazil,Historical,623329,1.09,295183.60,Yes,200,air,08-16-25,08-23-25
4,WJCCQlepnz,France,Cultural,124867,1.43,547893.24,No,800,land,06-20-25,06-27-25
...,...,...,...,...,...,...,...,...,...,...,...
5984,xAzwnVKAqz,USA,Urban,828137,1.97,132848.78,No,1700,land,09-01-25,09-08-25
5985,IfKotyaJFC,France,Nature,276317,3.53,325183.96,Yes,900,land,12-19-25,12-26-25
5986,bPyubCWGgA,Egypt,Beach,809198,3.37,927336.50,No,700,air,09-06-25,09-13-25
5987,kkWIucpBnu,Egypt,Cultural,808303,2.52,115791.43,Yes,700,land,08-18-25,08-25-25
5988,gHXUrdticm,France,Cultural,40939,4.65,957026.85,Yes,950,air,01-24-26,01-31-26